In [1]:
import pandas as pd

In [12]:
chicago = pd.read_csv("chicago.csv")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

## Common String Methods - .lower( ), .upper( ), .title( ) and .len( )

In [13]:
chicago = pd.read_csv("chicago.csv")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [15]:
chicago.Name.str.lower()

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [16]:
chicago.Name.str.title()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [18]:
chicago["Position Title"] = chicago["Position Title"].str.title()

## The .str.replace( ) Method

In [31]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.Department = chicago.Department.astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [32]:
chicago.Department.str.replace("MGMNT", "Management")

0        WATER Management
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4        WATER Management
               ...
32057    GENERAL SERVICES
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
Name: Department, Length: 32062, dtype: object

In [33]:
chicago.Department = chicago.Department.str.title()

In [34]:
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  Water Mgmnt              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       Police              $84450.00
2     AARON,  KARINA    POLICE OFFICER       Police              $84450.00

In [38]:
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$", "").astype(float)

/var/folders/1f/qym7_7s50n93hy01ns1kvqfc0000gn/T/ipykernel_76453/1581731207.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$", "").astype(float)

In [39]:
chicago["Employee Annual Salary"].mean()

80204.178633899

## Filtering with String Methods

In [40]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [44]:
mask = chicago["Position Title"].str.contains("water")

In [45]:
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",water rate taker,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",foreman of water pipe construction,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",water chemist ii,WATER MGMNT,$82044.00
685,"ANDERSON, ANDREW J",district superintendent of water distribution,WATER MGMNT,$109272.00
702,"ANDERSON, DONALD",foreman of water pipe construction,WATER MGMNT,$102440.00
...,...,...,...,...
29669,"VERMA, ANUPAM",managing engineer - water management,WATER MGMNT,$111192.00
30239,"WASHINGTON, JOSEPH",water chemist iii,WATER MGMNT,$89676.00
30544,"WEST, THOMAS R",gen supt of water management,WATER MGMNT,$115704.00
30991,"WILLIAMS, MATTHEW",foreman of water pipe construction,WATER MGMNT,$102440.00
31405,"WOODRIDGE, ROBERT L",foreman of water pipe construction,WATER MGMNT,$102440.00

In [47]:
mask = chicago["Position Title"].str.startswith("water")

In [48]:
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",water rate taker,WATER MGMNT,$90744.00
671,"ANDER, PERRY A",water chemist ii,WATER MGMNT,$82044.00
1054,"ASHLEY, KARMA T",water chemist ii,WATER MGMNT,$82044.00
1079,"ATKINS, JOANNA M",water chemist ii,WATER MGMNT,$82044.00
1181,"AZEEM, MOHAMMED A",water chemist ii,WATER MGMNT,$53172.00
...,...,...,...,...
28574,"THREATT, DENISE R",water quality inspector,WATER MGMNT,$62004.00
28602,"TIGNOR, DARRYL B",water rate taker,WATER MGMNT,$78948.00
28955,"TRAVIS COOK, LESLIE R",water rate taker,WATER MGMNT,$78948.00
29584,"VELAZQUEZ, JOHN",water rate taker,WATER MGMNT,$78948.00
30239,"WASHINGTON, JOSEPH",water chemist iii,WATER MGMNT,$89676.00

In [50]:
mask = chicago["Position Title"].str.endswith("ist")

In [51]:
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",psychiatrist,HEALTH,$99840.00
308,"ALARCON, LUIS J",loan processing specialist,COMMUNITY DEVELOPMENT,$81948.00
422,"ALLAIN, CAROLYN",senior telecommunications specialist,DoIT,$89880.00
472,"ALLEN, ROBERT",machinist,WATER MGMNT,$94328.00
705,"ANDERSON, EDWARD M",sr procurement specialist,PROCUREMENT,$91476.00
...,...,...,...,...
31667,"YODER, TERESA G",archival specialist,PUBLIC LIBRARY,$74304.00
31688,"YOUNGBLOOM, LAURENCE G",crimes surveillance specialist,OEMC,$19676.80
31717,"YOUNG, KIMBERLY M",sr procurement specialist,PROCUREMENT,$68556.00
31837,"ZAPATA, HUGO",sr procurement specialist,PROCUREMENT,$87324.00
31918,"ZEMKE, RICHARD P",machinist,AVIATION,$94328.00

## More String Methods - .strip( ), .lstrip( ), and .rstrip( )

In [52]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [53]:
chicago.Name.str.strip()

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32057    ZYGADLO,  MICHAEL J
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32062, dtype: object

## String Methods on Index and Columns

In [55]:
chicago = pd.read_csv("chicago.csv", index_col="Name").dropna(how="all")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                     Position Title   Department Employee Annual Salary
Name
AARON,  ELVIA J    WATER RATE TAKER  WATER MGMNT              $90744.00
AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
AARON,  KARINA       POLICE OFFICER       POLICE              $84450.00

In [56]:
chicago.index = chicago.index.str.strip().str.title()

In [57]:
chicago.head(3)

                     Position Title   Department Employee Annual Salary
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

In [58]:
chicago.columns=chicago.columns.str.upper()

In [59]:
chicago.head(3)

                     POSITION TITLE   DEPARTMENT EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

In [60]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [61]:
chicago.Name.str.split(",")

0            [AARON,   ELVIA J]
1          [AARON,   JEFFERY M]
2             [AARON,   KARINA]
3        [AARON,   KIMBERLEI R]
4        [ABAD JR,   VICENTE M]
                  ...
32057    [ZYGADLO,   MICHAEL J]
32058     [ZYGOWICZ,   PETER J]
32059      [ZYMANTAS,   MARK E]
32060    [ZYRKOWSKI,   CARLO E]
32061    [ZYSKOWSKI,   DARIUSZ]
Name: Name, Length: 32062, dtype: object

In [62]:
chicago.Name.str.split(",").str.get(0)

0            AARON
1            AARON
2            AARON
3            AARON
4          ABAD JR
           ...
32057      ZYGADLO
32058     ZYGOWICZ
32059     ZYMANTAS
32060    ZYRKOWSKI
32061    ZYSKOWSKI
Name: Name, Length: 32062, dtype: object

In [63]:
chicago.Name.str.split(",").str.get(0).value_counts()

WILLIAMS     293
JOHNSON      244
SMITH        241
BROWN        185
JONES        183
            ...
HORN           1
HORNE JR       1
HORNER         1
HORNIK         1
ZYSKOWSKI      1
Name: Name, Length: 13830, dtype: int64

In [64]:
chicago["Position Title"].str.split(" ").str.get(0).str.title().value_counts()

Police             10856
Firefighter-Emt     1509
Sergeant            1186
Pool                 918
Firefighter          810
                   ...
Dentist                1
Assoc                  1
Telephone              1
Mayor                  1
Prepress               1
Name: Position Title, Length: 320, dtype: int64

In [65]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [71]:
chicago.Name.str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).value_counts()

MICHAEL     1153
JOHN         899
JAMES        676
ROBERT       622
JOSEPH       537
            ...
DEENA          1
CHERRISE       1
EARTHA         1
ERNIKA         1
MAC            1
Name: Name, Length: 5091, dtype: int64

## expand and n Parameters with .split( ) Methods

In [72]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.Department = chicago.Department.astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [74]:
chicago[["First Name", "Last name"]] = chicago.Name.str.split(",", expand=True)

In [76]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [78]:
chicago[["First Title Word", "Last Title Word"]] = chicago["Position Title"].str.split(" ", expand=True, n=1)

In [79]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,First Name,Last name,First Title Word,Last Title Word
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA,POLICE,OFFICER